Revit 2027 API
DocumentOpeningEventArgs Class
 The event arguments used by the DocumentOpening event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DocumentOpeningEventArgs : RevitAPIPreEventArgs
Public Class DocumentOpeningEventArgs
	Inherits RevitAPIPreEventArgs
public ref class DocumentOpeningEventArgs : public RevitAPIPreEventArgs
type DocumentOpeningEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
The DocumentOpeningEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
DocumentType |  Type of the document, e.g. Project or Template.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
PathName |  Path of the document to be opened.
Top
Methods
Name | Description
Cancel |  When the event is cancellable, may call the Cancel() method to cancel it.
(Inherited from RevitAPIPreEventArgs)
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace